# *WELCOME TO PYTHON* âœ…

Lesson 5

Ref to Course: Python for Data Science and Machine Learning Bootcamp

In this section of the course we will learn how to use pandas for data analysis. We can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course, we should go through the notebooks in this order:

Introduction to Pandas
Series
DataFrames
Missing Data
GroupBy
Merging, Joining and Concatenating
Operations
Data Input and Output

# Series
The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples

In [4]:
import numpy as np
import pandas as pd

#Creatig a Series 

#We can convert al list, numpy array, or dictionary to a Series

In [34]:
labels = ['a', 'b', 'c']
my_list = [10, 20, 30] 
arr = np.array(my_list) # arrays -> they know how to perform: element wise operation 
d = {'a':10, 'b':20, 'c':30}

In [35]:
my_list

[10, 20, 30]

In [36]:
# Using Lists
type(pd.Series(data=my_list))
# an index

pandas.core.series.Series

In [37]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [38]:
pd.Series(my_list, labels) # we don't need to tell the function which param is data, which is index

a    10
b    20
c    30
dtype: int64

In [ ]:
# NumPy Arrays
pd.Series(arr)

In [ ]:
pd.Series(arr, labels)

In [39]:
#Dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

Data in a Series

A pandas Series can hold a variety of object types:

In [ ]:
pd.Series(data=labels)

In [ ]:
# Even functions (although unlikely that we will use this)
pd.Series([sum, print, len])

# Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [ ]:
series_one = pd.Series([1, 2, 3, 4], index = ['Gambia', 'Mali', 'Luxembourg', 'Malta'])
series_two = pd.Series([1, 2, 5, 4], index = ['Gambia', 'Mali','Italy', 'Luxembourg'])

In [ ]:
series_one + series_two
# please note that in series/frames operations, Python will convert the ints to floats, in order not no lose any infromation

In [6]:
l_1 = [1, 2, 3]
l_2 = [4, 5, 6]

In [7]:
# This would not perform element wise addition
l_1 + l_2

[1, 2, 3, 4, 5, 6]

In [8]:
a_1 = np.array([1, 2, 3])
a_2 = np.array([3, 5, 6])

In [9]:
a_1 + a_2

array([4, 7, 9])

# DataFrames 
DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a dDataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic. 

Link to Panda's documentation: https://pandas.pydata.org/docs/index.html

In [2]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101)
#seed means that each time we run this code, we will get the same random numbers.

In [3]:
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [4]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [5]:
'W X Y Z'.split()

['W', 'X', 'Y', 'Z']

In [6]:
df = pd.DataFrame(randn(5,4), index=['A','B','C','D','E'], columns = 'W X Y Z'.split()) # we just created  data frame

In [7]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df.head()  #get the first several rows only , by default there are 5 to be displayed

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [22]:
df.shape   #attribute (property)
# (Number of ROWS, Number of COLUMNS)

(5, 4)

In [23]:
df.describe()  #descriptive statistics, gving basi nfirmaio of total number of elements, etc

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.072331  0.660979 -0.321135  0.367287
std    0.499191  1.121089  0.971818  1.121759
min   -0.497104 -0.754070 -1.706086 -1.159119
25%   -0.134841  0.072960 -0.943406  0.184502
50%   -0.116773  0.390528  0.166905  0.329646
75%    0.302665  1.693723  0.238127  0.484752
max    0.807706  1.901755  0.638787  1.996652

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [30]:
df['W'] #get data out fo column W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [31]:
type(df['W'])

pandas.core.series.Series

In [35]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [33]:
type(df[['W','Z']] )

pandas.core.frame.DataFrame

DataFrame Columns are just Series

Creating a NEw COlumn

In [36]:
df['new'] = df['W'] + df['Y']  #we do not need a for loop, it goes element-wise (bitwise)

In [37]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

Removing Columns

In [38]:
df.drop('new',axis = 1) # axis 0 -> rows,  axis 1 -> columns

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [51]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [52]:
df.drop('new', axis=1, inplace=True)

In [53]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [8]:
# dropping rows on thsi way
df.drop('E', axis =0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

SELECTING ROWS

In [55]:
type(df.loc['A'])

pandas.core.series.Series

In [56]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [57]:
# Or select based off of position instead of label 
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [58]:
#Selecting subset of rows and columns 
df.loc['B', 'Y']  # a cell value and a way how to approach it

0.16690463609281317

In [59]:
#extractign one subset / part of the dataset from dataFrame 
df.loc[['A','B'],['W','Y']]  #first pair of parameters are indexes, second pair columns

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

# Conditional Selection

An important feature of pandas is conditional selection using bracket notation!

In [9]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [10]:
df[df['W']>0]   #brings out only positive values out of column W

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [11]:
# getting just one column of the selection
df[df['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [12]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

For two conditions we can use | and & with parenthesis:

In [13]:
df[(df['W']>0) | (df['Y'] >1)] #"and" can not be used in series notation, "and" only works on Boolean data type
# please use | -> or; & -> and

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [14]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

# Optional

In [ ]:
df > 0 #A map od booleans is what drives thsi conditional selection

In [15]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Index Details

In [15]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [17]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [18]:
new_index = 'CA NY WY OR CO'.split()

In [19]:
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [20]:
df['States'] = new_index

In [21]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [24]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [25]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [26]:
# or we could just have used:
df.set_index('States', inplace = True)

In [27]:
df

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

# MISSING DATA

Lets show a few convenient methods to deal with Missing Data in pandas

In [28]:
df = pd.DataFrame({'A':[1, 2, np.nan],
             'B':[5, np.nan, np.nan],
              'C':[1,2,3]})

In [29]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [30]:
df.dropna()  #drop rows

     A    B  C
0  1.0  5.0  1

In [31]:
df.dropna(axis=1)  #drop columns

   C
0  1
1  2
2  3

In [45]:
#drop just the rows where NaN appears twice or more 
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [46]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [47]:
df['A'].fillna(value=df['A'].mean())  #this does not assign it back to column A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [48]:
df['A'] = df['A'].fillna(value=df['A'].mean())  #this assigns it back to column A

In [49]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

# GROUP BY

In [2]:
# Create dataframe
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}

In [3]:
df = pd.DataFrame(data) #Create a dataframe of a dictionary

NameError: name 'pd' is not defined

In [52]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

Now we can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object.

In [53]:
df.groupby('Company')

In [54]:
by_comp = df.groupby('Company')

In [55]:
by_comp.groups

{'FB': [4, 5], 'GOOG': [0, 1], 'MSFT': [2, 3]}

In [56]:
by_comp.count()  # .sum(); .mean(); .median() ; .min(); .max(); ...

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [57]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [58]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [59]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [60]:
by_comp.describe() # we can call a describe on a groupby object as well!

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [61]:
by_comp.describe().loc['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Merging, Joining and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. Here we will discuss these 3 methods with examples

In [32]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [33]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [34]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [35]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [36]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [37]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Concatenation
Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis we are concatenating on. We can use pd.concat and pass in a list of DataFrames to concatenate together

In [8]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [9]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [10]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
             'A':['A0','A1','A2','A3'],
             'B':['B0','B1','B2','B3']})

In [14]:
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
             'C':['C0','C1','C2','C3'],
             'D':['D0','D1','D2','D3']})

In [13]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

right

# Merging
The merge function allows us to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [12]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [17]:
# OR to show a more complicated example:
left = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                    'key2':['K0','K1','K0','K1'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key1': ['K0','K0','K1','K2'],
                    'key2':['K0','K0','K0','K0'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [18]:
pd.merge(left, right, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K0   K0  A0  B0  C1  D1
2   K1   K0  A2  B2  C2  D2

In [20]:
pd.merge(left, right, how='outer', on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K0   A0   B0   C1   D1
2   K0   K1   A1   B1  NaN  NaN
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [21]:
pd.merge(left, right, how='right', on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K0   K0   A0   B0  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [22]:
pd.merge(left, right, how='left', on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K0  A0  B0   C1   D1
2   K0   K1  A1  B1  NaN  NaN
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [28]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                    'B':['B0','B1','B2']},
                    index = ['K0','K1','K2'])
right = pd.DataFrame({'C':['C0','C1','C2'],
                    'D':['D0','D1','D2']},
                    index = ['K0','K2','K3'])

In [29]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [30]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

# Operations
There are lots of operations with pandas that will be really useful to us, but don't fall into any distinct category. Let's show them here in this lecture!

In [37]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4], 'col2':[444,555,666,444], 'col3':['abc','def','ghi','xyz']})

In [38]:
# Info on Unique Values
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [39]:
df['col2'].nunique()

3

In [41]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [42]:
# select from DataFrame using criteria from multiple columns
new_df = df[(df['col1']>2) & (df['col2']==444)]

In [43]:
new_df

   col1  col2 col3
3     4   444  xyz

# Applying FUnctions

In [44]:
def times2(x):
    return x*2

In [45]:
df['col1'].apply(times2) #multiply by 2 the elements of column 'col1'

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [46]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [47]:
df['col1'].sum() #apply an aggregation function

10

In [49]:
# Permanently removing a column 
del df['col1']

In [50]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [51]:
# Get column and index names
df.columns

Index(['col2', 'col3'], dtype='object')

In [52]:
df.index

RangeIndex(start=0, stop=4, step=1)

# Sorting and Ordering a DataFrame

In [53]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [54]:
# Drop rows with NaN Values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [56]:
# Filling in NaN values with something else
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                 'col2':[np.nan,555,666,444],
                 'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [58]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

# Importantty methods and attributes:

In [ ]:
df.shape()
df.describe()
df.head()
df['select_column']
df['select_col_1','select_col_2']
df.drop('new', axis=1) # axis 0 -> rows; axis 1 -> columns
df.drop('new', axis=1, inplace=True)
df.loc['A']
df.iloc[2]
df[df['col_name'] > 0]
df[(df['col_1']>0) & (df['col_2'] > 1)]
df.reset_index()
df.set_index('col_name')
df.dropna() # drop rows
df.fillna(value='FILL VALUE')
df.groupby('col_name').mean()
pd.concat([df1,df2,df3])
pd.merge(left, right, how='inner', on='key')
left.join(right, how='outer')
df['col_name'].unique()
df['col_name'].nunique()
df['col_name'].value_counts()
df['col_name'].apply(function)
df.columns
df.index
df.sort_values(by='col_name')
df.isnull()